
Просто поражаюсь некоторым личностям, обучающимся на IT-специальностях. На очередном экзамене по программированию девушке из группы досталось простенькое задание: написать программу, которая запрашивает у пользователя некоторую строку и подсчитывает количество слов в ней с последующим выводом результатов на экран. Задача более чем тривиальна, однако девушка решила её очень оригинальным способом. Код выглядел примерно так:void main(){char* str;int c;cout<<"Введите строку: "; cin>>str;cout<<"Введите количество слов в строке: "; cin>>c;cout<<"В строке "<<c<<" слов";}Вот он, гений оптимизации! Зачем нагружать компьютер избыточными операциями? Пользователю надо — вот пусть сам и разбирается.Героиня получила твёрдую тройку за поднятое настроение.


